Revit 2026 API

# CeramicBumpType Enumeration

---

The enumerated type representing the permitted values for the asset property "CeramicBump" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CeramicBumpType
```
```vb
Public Enumeration CeramicBumpType
```
```cpp
public enum class CeramicBumpType
```
```fsharp
type CeramicBumpType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 2 |  |
| None | 0 |  |
| Wavy | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace